# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
 
# QHNetv1.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, SCD, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, LCF, [128, True]]   # 2
  - [-1, 1, SCD, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, LCF, [256, True]]   # 4
  - [-1, 1, SCD, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, LCF, [512, True]]   # 6
  - [-1, 1, SCD, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, LCF, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

 
# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, LCF, [512]]  # 13
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, LCF, [256]]  # 16 (P3/8-small)
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, LCF, [128]]  # 19 (P2/4-xsmall)
 
  - [-1, 1, SCD, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P3
  - [-1, 3, LCF, [256]]  # 22 (P3/8-small)
 
  - [-1, 1, SCD, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, LCF, [512]]  # 25 (P4/16-medium)
 
  - [-1, 1, SCD, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, LCF, [1024]]  # 28 (P5/32-large)
 
  - [[18, 21, 24, 27], 1, QHD, [nc]]  # Detect(P2, P3, P4, P5)





  



  


